In [122]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
import numpy as np

In [3]:
train = pd.read_csv("D:\\APP\\NITW\\Machine Learning\\Assignment-5\\Problem-2\\Titanic_train.csv")

In [5]:
train.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,463,0,1,"Gee, Mr. Arthur H",male,47.0,0,0,111320,38.5000,E63,S
1,1,121,0,2,"Hickman, Mr. Stanley George",male,21.0,2,0,S.O.C. 14879,73.5000,NaN,S
2,3,415,1,3,"Sundman, Mr. Johan Julian",male,44.0,0,0,STON/O 2. 3101269,7.9250,NaN,S
3,4,480,1,3,"Hirvonen, Miss. Hildur E",female,2.0,0,1,3101298,12.2875,NaN,S
4,5,622,1,1,"Kimball, Mr. Edwin Nelson Jr",male,42.0,1,0,11753,52.5542,D19,S

In [168]:
missing_age = pd.Series(train['Age']).isnull().sum()

In [169]:
print(missing_age)

153

In [37]:
null_columns = train.columns[train.isnull().any()]

In [60]:
print(null_columns.size)

3

In [56]:
null_index_list.clear()

In [204]:
'''for col in null_columns:
    null_index_list.extend(train[train[col].isnull()].index.tolist())

print(set(null_index_list))'''

'for col in null_columns:\n    null_index_list.extend(train[train[col].isnull()].index.tolist())\n\nprint(set(null_index_list))'

In [69]:
null_index_list = (train[train['Age'].isnull()].index.tolist())

In [145]:
sum_null_indexes = sum(set(null_index_list))

In [146]:
print(sum_null_indexes)

63430

In [187]:
#Defining features and target variable
trainValid = train.dropna(subset=['Age'])
X_train = trainValid.drop(columns = ['Age', 'Name', 'Sex', 'Ticket', 'Cabin', 'Embarked', 'Fare', 'Unnamed: 0'])
y_train = trainValid.Age[trainValid['Age'].notnull()]

In [182]:
X_train.shape

(628, 5)

In [188]:
y_train.head()

0    47.0
1    21.0
2    44.0
3     2.0
4    42.0
Name: Age, dtype: float64

In [86]:
trainNA = train[train.Age.isnull()]

In [189]:
X_test = trainNA.drop(columns = ['Age', 'Name', 'Sex', 'Ticket', 'Cabin', 'Embarked', 'Fare', 'Unnamed: 0'])
y_test = trainNA.Age[trainNA['Age'].isnull()]

In [190]:
y_test.head()

7    NaN
15   NaN
33   NaN
37   NaN
58   NaN
Name: Age, dtype: float64

In [75]:
trainValid.isnull().any()

Unnamed: 0     False
PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [184]:
lr = LinearRegression()

In [191]:
lr.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [192]:
y_pred = lr.predict(X_test)

In [200]:
mean_of_replace_values = round(np.mean(y_pred), 1)

In [142]:
#trainNA['Age'].replace(to_replace=y_test.values, value=y_pred, inplace=True)

In [143]:
trainNA.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,9,599,0,3,"Boulos, Mr. Hanna",male,NaN,0,0,2664,7.2250,NaN,C
15,20,833,0,3,"Saad, Mr. Amin",male,NaN,0,0,2671,7.2292,NaN,C
33,38,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
37,44,359,1,3,"McGovern, Miss. Mary",female,NaN,0,0,330931,7.8792,NaN,Q
58,68,590,0,3,"Murdlin, Mr. Joseph",male,NaN,0,0,A./5. 3235,8.0500,NaN,S

In [201]:
result=[missing_age, sum_null_indexes, mean_of_replace_values]

In [202]:
result

[153, 63430, 28.1]

In [203]:
# Finally create a dataframe of the final output  and write the output to output.csv
result=pd.DataFrame(result)
# writing output to output.csv
result.to_csv('D:\\APP\\NITW\\Machine Learning\\Assignment-5\\Problem-2\\output.csv', header=False, index=False)